{
"f12":[
{"id":1,"type":"F12","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Ferrari_F12_Berlinetta_-_Mondial_de_l%27Automobile_de_Paris_2012_-_001.jpg/420px-Ferrari_F12_Berlinetta_-_Mondial_de_l%27Automobile_de_Paris_2012_-_001.jpg","info":"The Ferrari F12berlinetta[3] (Type F152) is a front mid-engine, rear-wheel-drive grand tourer produced by Italian automobile manufacturer Ferrari. The F12berlinetta debuted at the 2012 Geneva Motor Show, and replaces the 599 grand tourer.[6] The naturally aspirated 6.3 litre Ferrari V12 engine used in the F12berlinetta has won the 2013 International Engine of the Year Award in the Best Performance category and Best Engine above 4.0 litres. The F12berlinetta was named "The Supercar of the Year 2012" by car magazine Top Gear. The F12berlinetta was replaced by the 812 Superfast in 2017."}
],
"458":[
{"id":1,"type":"458","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/2011_Ferrari_458_Italia_DCT_S-A_4.5_Front.jpg/420px-2011_Ferrari_458_Italia_DCT_S-A_4.5_Front.jpg","info":"The Ferrari 458 Italia (Type F142) is a mid-engine sports car produced by the Italian automobile manufacturer Ferrari. The 458 replaced the F430, and was first officially unveiled at the 2009 Frankfurt Motor Show.[5][6] It was succeeded by the 488 GTB (Gran Turismo Berlinetta), which was unveiled at the 2015 Geneva Motor Show."}
],
"f110":[
{"id":1,"type":"F110","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/1991_Ferrari_Testarossa_4.9.jpg/420px-1991_Ferrari_Testarossa_4.9.jpg","info":"The Ferrari Testarossa (Type F110) is a 12-cylinder mid-engine sports car manufactured by Ferrari, which went into production in 1984 as the successor to the Ferrari Berlinetta Boxer. The Pininfarina-designed car was originally produced from 1984 to 1991, with two model revisions following the end of Testarossa production called the 512 TR and F512 M, which were produced from 1992 to 1996. Including revised variations, almost 10,000 cars in total were produced, making it one of the most mass-produced Ferrari models."}
]
}
